src/index.org
#+TITLE: Jay Kamat
#+AUTHOR: Jay Kamat
#+EMAIL: jaygkamat@gmail.com
#+DATE: <2016-12-05>

# Add css to this page relative so it works locally too.
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="src/jgkamat.css"> <link href="https://fonts.googleapis.com/css?family=Open+Sans" rel="stylesheet">

# Macro to determine age of things (years). Input the start year and it will return its age.
#+MACRO: age-years src_emacs-lisp[:results raw :cache yes]{(- (string-to-number (format-time-string "%Y")) (elt (parse-time-string "$1") 5))}

# #+BEGIN_SRC emacs-lisp :exports none :results output
#   ;; Found in project.el
#   (fboundp 'gh-stars)
#   (fbountp 'org-link-to-str)
# #+END_SRC


* Introduction
Hi! I'm {{{author}}}, an undergraduate computer science student at Georgia Tech, and I'm interested in everything related to science, technology, computers, engineering, and space!

** Links
- [[https://www.github.com/jgkamat][GitHub]]
- [[https://gitlab.com/u/jgkamat][GitLab]]
- [[file:blog/home.org][Blog]]
- [[https://hub.docker.com/u/jgkamat/][DockerHub]]
- [[https://www.linkedin.com/in/jaykamat][Linkedin]]

* Projects
** Personal Projects

These are projects that I have created purely for fun, or for improvements in my day to day workflow.

1. [[https://github.com/jgkamat/alda-mode][alda-mode]]

   An Emacs major mode for [[https://github.com/alda-lang/alda][alda]]
2. [[https://github.com/jgkamat/DoCIF][DoCIF]]

  A Docker CI Framework, Leveraging Github/CircleCI
3. [[https://github.com/jgkamat/elevator-linked-list][elevator-linked-list]]

  A C++ demo on how the design of super-tall elevators can be used to improve linked list performance
4. [[http://www.github.com/MountainRange/mobius-tunes][Mobius-Tunes]]

  Created at HackGT 2015
5. [[https://github.com/jgkamat/ViPaint][ViPaint]]

  A vi inspired, modal painting program, written in Java
6. [[https://github.com/jgkamat/dotfiles][dotfiles]]

   My dotfiles, containing all my configs and desktop automation tools
7. [[https://github.com/jgkamat/JayLayer/][JayLayer]]

  A Java MP3 wrapper library to make sound easy!
8. [[https://github.com/jgkamat/JPlanetSimulator][JPlanetSimulator]]

  A Java 2D N-Body Planet Simulation using Newton's Laws
** Contributions to OSS
- Major Contributions
  1. [[https://github.com/RoboJackets/robocup-software][robocup-software]]

     Actively contributing through undergrad. See [[https://github.com/RoboJackets/robocup-software/pulls?q=is%3Apr+author%3Ajgkamat+is%3Aclosed][my merged pull requests]] for details.
  2. [[https://github.com/alda-lang/alda][Alda]]

     Contributed the Alda auto-updater. See ~alda update~

- Minor Contributions
  1. [[https://github.com/TricksterGuy/complx][Complx]] docker support
  2. [[https://github.com/dpayne/cli-visualizer][cli-visulizer]] xdg home support
** School Projects
1. [[https://github.com/MountainRange/MULE][MULE Clone]]

   Created for a project based class for CS2340 at Georgia Tech
* About
** Languages
# Since 2009
+ Java /(7 Years)/
+ Shell /({{{age-years(2013)}}} years)/
+ Python /({{{age-years(2014)}}} years)/
+ C /({{{age-years(2014)}}} years)/
  # Since 2015
+ Common Lisp /(2 years)/
** Skills
- Linux /({{{age-years(2010)}}} years)/
  + Deb Based
  + RPM Based
  + Arch Linux
- Vim/Emacs Editing
  + [[https://github.com/jgkamat/dotfiles][My Personal Configs]]
- Docker /({{{age-years(2013)}}} years)/
  + Plain Docker
  + Docker Swarm
  + Advanced Docker Networking
- Testing and CI
  + CircleCI
  + Jenkins
  + GoCD
  + Travis
- Robotics
  + [[http://homesteadrobotics.com/][Homestead HRT]] - FRC Team 670 /(2012-2014)/
  + [[https://www.robojackets.org/][Georgia Tech RoboJackets]] - RoboCup /(2014-Present)/
* Contact
- [[mailto:jaygkamat@gmail.com][Email]]
