index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-10-16 Sun 01:27 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Jay Kamat</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Jay Kamat" />
<link rel="stylesheet" type="text/css" href="src/jgkamat.css"> <link href="https://fonts.googleapis.com/css?family=Open+Sans" rel="stylesheet">
</head>
<body>
<div id="content">
<h1 class="title">Jay Kamat</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline2">1. Introduction</a>
<ul>
<li><a href="#orgheadline1">1.1. Links</a></li>
</ul>
</li>
<li><a href="#orgheadline6">2. Projects</a>
<ul>
<li><a href="#orgheadline3">2.1. Personal Projects</a></li>
<li><a href="#orgheadline4">2.2. Contributions to OSS</a></li>
<li><a href="#orgheadline5">2.3. School Projects</a></li>
</ul>
</li>
<li><a href="#orgheadline9">3. About</a>
<ul>
<li><a href="#orgheadline7">3.1. Languages</a></li>
<li><a href="#orgheadline8">3.2. Skills</a></li>
</ul>
</li>
<li><a href="#orgheadline10">4. Contact</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Hi! I'm Jay Kamat, an undergraduate computer science student at Georgia Tech, and I'm interested in everything related to science, technology, computers, engineering, and space!
</p>
</div>

<div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> Links</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><a href="https://www.github.com/jgkamat">GitHub</a></li>
<li><a href="https://hub.docker.com/u/jgkamat/">DockerHub</a></li>
<li><a href="https://gitlab.com/u/jgkamat">GitLab</a></li>
<li><a href="https://www.linkedin.com/in/jaykamat">Linkedin</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">2</span> Projects</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">2.1</span> Personal Projects</h3>
<div class="outline-text-3" id="text-2-1">
<p>
These are projects that I have created purely for fun, or for improvements in my day to day workflow.
</p>

<ol class="org-ol">
<li><p>
<a href="https://github.com/jgkamat/alda-mode">alda-mode</a>
</p>

<p>
An Emacs major mode for <a href="https://github.com/alda-lang/alda">alda</a>
</p></li>
<li><p>
<a href="https://github.com/jgkamat/DoCIF">DoCIF</a>
</p>

<p>
A Docker CI Framework, Leveraging Github/CircleCI
</p></li>
<li><p>
<a href="https://github.com/jgkamat/elevator-linked-list">elevator-linked-list</a>
</p>

<p>
A C++ demo on how the design of super-tall elevators can be used to improve linked list performance
</p></li>
<li><p>
<a href="http://www.github.com/MountainRange/mobius-tunes">Mobius-Tunes</a>
</p>

<p>
Created at HackGT 2015
</p></li>
<li><p>
<a href="https://github.com/jgkamat/ViPaint">ViPaint</a>
</p>

<p>
A vi inspired, modal painting program, written in Java
</p></li>
<li><p>
<a href="https://github.com/jgkamat/dotfiles">dotfiles</a>
</p>

<p>
My dotfiles, containing all my configs and desktop automation tools
</p></li>
<li><p>
<a href="https://github.com/jgkamat/JayLayer/">JayLayer</a>
</p>

<p>
A Java MP3 wrapper library to make sound easy!
</p></li>
<li><p>
<a href="https://github.com/jgkamat/JPlanetSimulator">JPlanetSimulator</a>
</p>

<p>
A Java 2D N-Body Planet Simulation using Newton's Laws
</p></li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">2.2</span> Contributions to OSS</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Major Contributions
<ol class="org-ol">
<li><p>
<a href="https://github.com/RoboJackets/robocup-software">robocup-software</a>
</p>

<p>
Actively contributing through undergrad. See <a href="https://github.com/RoboJackets/robocup-software/pulls?q=is:pr+author:jgkamat+is:closed">my merged pull requests</a> for details.
</p></li>
<li><p>
<a href="https://github.com/alda-lang/alda">Alda</a>
</p>

<p>
Contributed the Alda auto-updater. See <code>alda update</code>
</p></li>
</ol></li>

<li>Minor Contributions
<ol class="org-ol">
<li><a href="https://github.com/TricksterGuy/complx">Complx</a> docker support</li>
<li><a href="https://github.com/dpayne/cli-visualizer">cli-visulizer</a> xdg home support</li>
</ol></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">2.3</span> School Projects</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li><p>
<a href="https://github.com/MountainRange/MULE">MULE Clone</a>
</p>

<p>
Created for a project based class for CS2340 at Georgia Tech
</p></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-2">
<h2 id="orgheadline9"><span class="section-number-2">3</span> About</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">3.1</span> Languages</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Java <i>(7 years)</i></li>
<li>Shell <i>(3 years)</i></li>
<li>Python <i>(2 years)</i></li>
<li>C <i>(2 years)</i></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">3.2</span> Skills</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Linux <i>(6 years)</i>
<ul class="org-ul">
<li>Deb Based</li>
<li>RPM Based</li>
<li>Arch Linux</li>
</ul></li>
<li>Vim/Emacs Editing
<ul class="org-ul">
<li><a href="https://github.com/jgkamat/dotfiles">My Personal Configs</a></li>
</ul></li>
<li>Docker <i>(3 years)</i>
<ul class="org-ul">
<li>Plain Docker</li>
<li>Docker Swarm</li>
<li>Advanced Docker Networking</li>
</ul></li>
<li>Testing and CI
<ul class="org-ul">
<li>CircleCI</li>
<li>Jenkins</li>
<li>GoCD</li>
<li>Travis</li>
</ul></li>
<li>Robotics
<ul class="org-ul">
<li><a href="http://homesteadrobotics.com/">Homestead HRT</a> - FRC Team 670 <i>(2012-2014)</i></li>
<li><a href="https://www.robojackets.org/">Georgia Tech RoboJackets</a> - RoboCup <i>(2014-Present)</i></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10"><span class="section-number-2">4</span> Contact</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="mailto:jaygkamat@gmail.com">Email</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jay Kamat</p>
<p class="date">Created: 2016-10-16 Sun 01:27</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
